dakota_openfoam_cases/ahmed/multi/casebase/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (40 0 0);

boundaryField
{
    inlet
    { 	type  fixedValue; 
	value uniform (40 0 0);
    }

    outlet
    {	type inletOutlet; 
	inletValue uniform (0 0 0);
     	value uniform (40 0 0);
    }

    "sides|top"
      {   type symmetry; }

    "ground|ahmed"
    {	type fixedValue; 
	value uniform (0 0 0);
    }
}

// ************************************************************************* //
