dakota_openfoam_cases/ahmed/multi/casebase/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 19000;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 19000;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 19000;
        value           uniform 19000;
    }
    ground
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 19000;
    }
    sides
    {
        type            symmetry;
    }
    top
    {
        type            symmetry;
    }
    ahmed
    {
        type            omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        beta1           0.075;
        value           uniform 19000;
    }
}

// ************************************************************************* //
