dakota_openfoam_cases/ahmed/multi/casebase/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-4 -1 0)
    (6 -1 0)
    (6  1 0)
    (-4  1 0)
    (-4 -1 2.0)
    (6 -1 2.0)
    (6  1 2.0)
    (-4  1 2.0)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (10 4 4) simpleGrading (1 1 1)
);

edges
(
);

patches
(
   patch inlet  (  (0 4 7 3)  )
   patch outlet (  (1 2 6 5)  )
   wall ground  (  (0 3 2 1)  )
/*
   symmetryPlane sides (  (3 7 6 2) (0 1 5 4) )
   symmetryPlane top   (  (4 5 6 7)  )
*/
   symmetry sides (  (3 7 6 2) (0 1 5 4) )
   symmetry top   (  (4 5 6 7)  )
);

// ************************************************************************* //
